# GetPipeSlopes Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeSettings..::..GetPipeSlopes Method
PipeSettings Class See Also
---
Get pipe slopes.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IList<double> GetPipeSlopes()
```

Visual Basic
---
```text
Public Function GetPipeSlopes As IList(Of Double)
```

Visual C++
---
```text
public:
IList<double>^ GetPipeSlopes()
```

# ### Return Value
Pipe slope values. Revit stores the slope value as a percentage (0-100).
# See Also
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace